<template>
    <f7-page name="about">
        <f7-navbar>
            <f7-nav-title>О компании</f7-nav-title>
        </f7-navbar>

        <f7-block strong class="about-content">
            <h2>ООО «Газпром недра»</h2>
            <img src="https://nedra.gazprom.ru/_ah/img/zUsv8Fx3GQeJZMpk7Mki3A" alt="nedra"/>
            <p>ООО «Газпром недра» — 100-процентное дочернее общество ПАО «Газпром», входит в число крупнейших российских сервисных компаний нефтегазовой отрасли. Создано в 2019 году за счет интеграции производственных потенциалов ООО «Газпром георесурс» и ООО «Газпром геологоразведка».</p>
            <p>ООО «Газпром недра» — специализированная многопрофильная компания, выполняющая централизованно полный цикл геологоразведочных работ на территории РФ и предоставляющая заказчикам широкий спектр уникальных геофизических и геолого-технических услуг.</p>
            <p>Производственная деятельность компании в области геологоразведки направлена на формирование предложений по развитию минерально-сырьевой базы, проведение подсчета запасов углеводородного сырья, постановку их на баланс в Государственной Комиссии по запасам, проведение опытно-промышленной эксплуатации и создание технологической схемы разработки месторождений.</p>
            <img src="https://nedra.gazprom.ru/_ah/img/iZemLH3PLAaBC4TltTxo2A=s1100" alt="nedra"/>
            <p>ООО «Газпром недра» является основным источником геофизических данных Группы «Газпром». Предоставляемая компанией геолого-геофизическая и технологическая информация обеспечивает принятие управленческих решений во всех производственных процессах ПАО «Газпром», начиная от поиска и разведки месторождений углеводородного сырья до ликвидации скважин при завершении эксплуатации.</p>
        </f7-block>
    </f7-page>
</template>

<script>
    import {f7Page, f7Block, f7Navbar, f7NavTitle} from 'framework7-vue';

    export default {
        name: "AboutPage",
        components: {
            f7Page, f7Block, f7Navbar, f7NavTitle
        }
    }
</script>

<style scoped>
    .block {
        margin: 10px 0;
    }
    .block-strong:before, .block-strong:after {
        height: 3px;
    }

    .about-content img {
        width: 100%;
    }
</style>
