<template>
    <f7-page name="article">
        <f7-navbar back-link="Назад">
            <f7-nav-title>{{article.pageTitle}}</f7-nav-title>
        </f7-navbar>

        <f7-block strong>
            <p><f7-icon size="22px" f7="calendar_today"></f7-icon> {{article.date}}</p>
            <p><f7-icon size="22px" f7="tag_circle"></f7-icon><span v-for="(tag, idx) in article.tags" :key="idx">{{tag}} </span></p>
        </f7-block>

        <f7-block strong>
            <template v-for="(item, idx) in article.content" >
                <h2 v-if="item.type === 'header'" :key="idx">{{item.text}}</h2>
                <f7-block strong inset class="article-highlight" v-else-if="item.type === 'highlight'" :key="idx">
                    <p>{{item.text}}</p>
                </f7-block>
                <p v-else-if="item.type === 'article'" :key="idx">{{item.text}}</p>
                <div class="article-image" v-else-if="item.type === 'img'" :key="idx">
                    <img :src="item.url" :alt="item.alt">
                    <p class="text-align-center">{{item.description}}</p>
                </div>
            </template>

            <p><b>{{article.author}}</b></p>
        </f7-block>
    </f7-page>
</template>

<script>
    export default {
        name: "ArticlePage",
        data() {
            return {
                id: this.$f7route.params.id,
                news: [
                    {
                        id: 1,
                        pageTitle: 'Бейкер Хьюз',
                        author: 'Иванесса Петрова',
                        date: '01.01.2021',
                        tags: [
                            'Новость',
                            'Статья'
                        ],
                        content: [
                            {
                                type: 'header',
                                text: 'ООО «Газпром недра» и компания «Бейкер Хьюз» договорились о сотрудничестве',
                            },
                            {
                                type: 'highlight',
                                text: '7 февраля 2020г. в Москве генеральный директор ООО «Газпром недра» Всеволод Черепанов и президент компании «Бейкер Хьюз» в России и СНГ Елена Акольцева подписали Соглашение о сотрудничестве.',
                            },
                            {
                                type: 'article',
                                text: 'Возможными направлениями сотрудничества участники соглашения определили: поиск и разработку месторождений углеводородов, оценку извлекаемых запасов, сервисную деятельность на объектах поиска, добычи и хранения углеводородов, бурение и геофизические исследования скважин и ряд других направлений.',
                            },
                            {
                                type: 'img',
                                url: 'https://nedra.gazprom.ru/_ah/img/YTf8WwffTDhxATGcn9PnzQ=s600',
                                description: 'Генеральный директор ООО «Газпром недра» Всеволод Черепанов и президент компании «Бейкер Хьюз» в России и СНГ Елена Акольцева на подписании Соглашения',
                                alt: 'General'
                            },
                            {
                                type: 'article',
                                text: 'В целях реализации соглашения стороны договорились сформировать совместную Программу сотрудничества, которая будет обновляться по решению специально создаваемой рабочей группы, действующей по вопросам сотрудничества.',
                            }
                        ]
                    },
                    {
                        id: 2,
                        pageTitle: 'Слушания',
                        author: 'Дмитрия Сергеевна, Николая Надеждовна',
                        date: '01.01.2021',
                        tags: [
                            'Новость'
                        ],
                        content: [
                            {
                                type: 'header',
                                text: 'Участники общественных слушаний одобрили проведение геологоразведочных работ на шельфе Карского моря',
                            },
                            {
                                type: 'highlight',
                                text: '4 февраля в селе Яр-Сале Ямальского района Ямало-Ненецкого автономного округа состоялись общественные слушания по проектной документации, касающейся проведения ООО «Газпром недра» геологоразведочных работ на шельфе Карского моря в 2020 году.',
                            },
                            {
                                type: 'article',
                                text: 'На рассмотрение общественности района были вынесена проекты «Строительство поисково-оценочной скважины № 2 Скуратовской площади» и «Строительство разведочной скважины № 5 Ленинградского газоконденсатного месторождения», включающие в себя материалы оценки воздействия на окружающую среду, а также планы предупреждения и ликвидации разливов нефти и нефтепродуктов.',
                            },
                            {
                                type: 'img',
                                url: 'https://nedra.gazprom.ru/_ah/img/wiV3lP1Gy-sLD7muswPpig',
                                description: 'В результате рассмотрения проектной документации на строительство объектов получено одобрение общественности на их реализацию.',
                                alt: 'General'
                            },
                            {
                                type: 'article',
                                text: 'Участникам слушаний была представлена полная информация о предусмотренных мероприятиях, предназначенных для минимизации экологических рисков на шельфе Карского моря. Технологии, которые планируется использовать при строительстве морских скважин, полностью соответствуют международным стандартам и требованиям законодательства Российской Федерации.',
                            }
                        ]
                    },
                    {
                        id: 3,
                        pageTitle: 'Евгений Белюскин',
                        author: 'Петра Касаткина',
                        date: '01.01.2021',
                        tags: [
                            'Новость'
                        ],
                        content: [
                            {
                                type: 'header',
                                text: 'Филиал «Газпром недра НТЦ» в Тюмени возглавил Евгений Белюскин',
                            },
                            {
                                type: 'highlight',
                                text: '30 января работникам Филиала «Газпром недра НТЦ» ООО «Газпром недра» (г. Тюмень) был официально представлен руководитель этого структурного подразделения компании Евгений Белюскин.',
                            },
                            {
                                type: 'article',
                                text: 'Нового начальника коллективу представил заместитель генерального директора по управлению персоналом и корпоративной защите ООО «Газпром недра» Алексей Яцков. «В этом подразделении сосредоточились лучшие силы в сфере геологоразведки. Впереди у нас долгая и плодотворная работа на благо России и ПАО „Газпром“, — сказал он.',
                            },
                            {
                                type: 'img',
                                url: 'https://nedra.gazprom.ru/_ah/img/1BWoHC76GiCROYzMS5xKhQ=s1100',
                                description: 'Жоржас Новикас и Алексей Яцков',
                                alt: 'General'
                            },
                            {
                                type: 'article',
                                text: 'Перед собравшимися также выступил заместитель генерального директора по имущественным и корпоративным отношениям Жоржас Новикас. „Теперь это один из ключевых филиалов компании, и те лучшие практики, которые здесь сформируются, без сомнений, будут экстраполированы на остальные структурные подразделения“, — сказал Жоржас Новикас.',
                            }
                        ]
                    },
                    {
                        id: 4,
                        pageTitle: 'Награждение работников',
                        author: 'Не ну это уж точно никто не прочтет',
                        date: '01.01.2021',
                        tags: [
                            'Статья'
                        ],
                        content: [
                            {
                                type: 'header',
                                text: 'Работник ООО «Газпром недра» удостоен государственной награды за работу по вводу в эксплуатацию Бованенковского НГКМ',
                            },
                            {
                                type: 'highlight',
                                text: '23 января 2020 года в рамках заседания Правления ПАО «Газпром» состоялась торжественная церемония награждения отличившихся работников компании и её дочерних организаций государственными наградами Российской Федерации..',
                            },
                            {
                                type: 'article',
                                text: 'Среди награжденных был и представитель ООО «Газпром недра», каротажник 6 разряда производственного филиала «Вуктылгазгеофизика» Геннадий Романов. Председатель Правления ПАО «Газпром» Алексей Миллер вручил ему медаль ордена «За заслуги перед Отечеством» II степени. К этой награде Г. Романов был представлен генеральным директором Общества Всеволодом Черепановым в связи с вводом в эксплуатацию объектов Бованенковского нефтегазоконденсатного месторождения и второй нитки газопровода Бованенково-Ухта.'
                            },
                            {
                                type: 'img',
                                url: 'https://nedra.gazprom.ru/_ah/img/6NhLiNgnS8zE7bjLvTIjjA=s1100',
                                description: 'На церемонии награждения в ПАО «Газпром»',
                                alt: 'General'
                            },
                            {
                                type: 'article',
                                text: 'Геннадий Романов начал свою трудовую деятельность каротажником в Ухтинской геофизической экспедиции Ухтинского территориального геологического управления. В ПФ «Вуктылгазгеофизика» трудится с 2004 года. В коллективе зарекомендовал себя инициативным работником, имеющим глубокие профессиональные знания и обладающим такими качествами, как высокая работоспособность, ответственность и творческий подход к решению производственных задач.',
                            }
                        ]
                    },
                ],
            }
        },
        computed: {
            article: function () {
                return this.news.find(article => article.id === parseInt(this.id, 10));
            }
        }
    }
</script>

<style scoped>
    .block {
        margin: 10px 0;
    }
    .block-strong:before, .block-strong:after {
        height: 3px;
    }

    .article-image {
        font-style: italic;
        font-size: 12px;
    }
    .article-image img {
        width: 100%
    }
    .article-highlight {
        background-color: #e7e7e7;
        margin: 0 !important;
    }
</style>
